/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package uits.jv1610.myrepository.hometasks.mainconstructions;

import java.util.Scanner;

/**
 *
 * @author Valery
 */
public class Task3 {
        public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int a = 0;
        while(a < 10){
            System.out.println("Enter your number: ");
            a = scanner.nextInt();
            if(a < 10){
                System.out.println("Wrong number, try again");
            }
        }
        String[] arr1 = {
                    "Дорогие друзья!",
                    "с другой стороны", 
                    "равным образом ", 
                    "Не следует, однако, забывать о том, что", 
                    "Таким образом,", 
                    "Повседневная практика показывает, что", 
                    "Значимость этих проблем настолько очевидна, что", 
                    "Разнообразный и богатый опыт", 
                    "Задача организации, в особенности же", 
                    "Соображения высшего порядка, а также" 
                        };
        String[] arr2 = {
                    "реализация намеченных плановых заданий", 
                    "рамки и место обучения кадров", 
                    "постоянный количественный рост и сфера нашей активности", 
                    "сложившаяся структура организации", 
                    "новая модель", 
                    "организационной деятельности", 
                    "дальнейшее развитие различных форм деятельности", 
                    "постоянное информационно-пропагандистское обеспечение нашей деятельности", 
                    "укрепления и развития структуры", 
                    "консультация с широким активом", 
                    "начало повседневной работы по формированию позиции" 
                        };
        String[] arr3 = {
                    "играет важную роль в формировании", 
                    "требуют от нас анализа", 
                    "требуют определения и уточнения", 
                    "способствует подготовке и реализации", 
                    "обеспечивает широкому кругу специалистов участие в формировании", 
                    "позволяет выполнить",
                    "важнейшие задания по разработке", 
                    "в значительной степени обуславливает создание", 
                    "позволяет оценить значение", 
                    "представляет собой интересный эксперимент проверки", 
                    "влечет за собой процесс внедрения и модернизации" 
                        };
        String[] arr4 = {
                    "существующих финансовых и административных условий", 
                    "дальнейших направлений развитая",
                    "системы массового участия", 
                    "позиций, занимаемых участниками в отношении поставленных задач", 
                    "новых предложений", 
                    "направлений прогрессивного развития", 
                    "системы обучения кадров", 
                    "соответствующей насущным потребностям", 
                    "соответствующих условий активизации", 
                    "модели развития", 
                    "форм воздействия" 
                        };
        for(int i = 0; i < a; i++){
            switch(i%4){
                case 0:{
                    System.out.print(arr1[(int)(Math.random()*(arr1.length-1))] + " ");
                }break;
                case 1:{
                    System.out.print(arr2[(int)(Math.random()*(arr2.length-1))] + " ");
                }break;
                case 2:{
                    System.out.print(arr3[(int)(Math.random()*(arr3.length-1))] + " ");
                }break;
                case 3:{
                    System.out.println(arr4[(int)(Math.random()*(arr4.length-1))] + " ");
                }break;
            }
        }
    }
}
